-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Окт 16 2019 г., 12:53
-- Версия сервера: 10.3.13-MariaDB-log
-- Версия PHP: 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `animal`
--

-- --------------------------------------------------------

--
-- Структура таблицы `table1`
--

CREATE TABLE `table1` (
  `id` int(11) NOT NULL,
  `class` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `size` int(11) NOT NULL,
  `tail` tinyint(1) NOT NULL,
  `kopyta` tinyint(1) NOT NULL,
  `roga` tinyint(1) NOT NULL,
  `wool` tinyint(1) NOT NULL,
  `hunter` tinyint(1) NOT NULL,
  `wild` tinyint(1) NOT NULL,
  `roga_horizontal` tinyint(1) NOT NULL,
  `roga_size` int(11) NOT NULL,
  `oreal` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `color` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `climat` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `fly` tinyint(1) NOT NULL,
  `smart` tinyint(1) NOT NULL,
  `night_animal` tinyint(1) NOT NULL,
  `name` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `skin` text COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `table1`
--

INSERT INTO `table1` (`id`, `class`, `size`, `tail`, `kopyta`, `roga`, `wool`, `hunter`, `wild`, `roga_horizontal`, `roga_size`, `oreal`, `color`, `climat`, `fly`, `smart`, `night_animal`, `name`, `skin`) VALUES
(1, 'Ссавець', 150, 1, 0, 0, 1, 1, 1, 0, 0, 'Саванна', 'Рудий', 'Жаркий', 0, 0, 0, 'Лев', '-'),
(3, 'Ссавець', 250, 1, 0, 0, 1, 1, 1, 0, 0, 'Ліс', 'Чорний', 'Помірний', 0, 0, 0, 'Чорний ведмідь', '-'),
(4, 'Ссавець', 250, 1, 0, 0, 1, 1, 1, 0, 0, 'Ліс', 'Бурий', 'Помірний', 0, 0, 0, 'Бурий ведмідь', '-'),
(5, 'Ссавець', 250, 1, 0, 0, 1, 1, 1, 0, 0, 'Північний полюс', 'Білий', 'Холодний', 0, 0, 0, 'Полярний ведмідь', '-'),
(6, 'Ссавець', 70, 1, 0, 0, 1, 0, 1, 0, 0, 'Ліс', 'Сірий', 'Помірний', 0, 0, 0, 'Заєць', '-'),
(7, 'Ссавець', 100, 1, 0, 0, 1, 1, 1, 0, 0, 'Ліс', 'Сірий', 'Помірний', 0, 0, 1, 'Вовк', '-'),
(8, 'Ссавець', 250, 1, 1, 0, 1, 0, 0, 0, 0, 'Європа', 'Коричневий', 'Помірний', 0, 0, 0, 'Кінь', '-'),
(9, 'Ссавець', 100, 1, 0, 0, 1, 1, 1, 0, 0, 'Євразія', 'Рудий Бурий', 'Помірний', 0, 0, 1, 'Рись', '-'),
(10, 'Ссавець', 120, 1, 1, 1, 1, 0, 1, 0, 15, 'Європа', 'Рудий', 'Помірний', 0, 0, 0, 'Косуля', '-'),
(11, 'Ссавець', 160, 1, 1, 1, 1, 0, 1, 0, 30, 'Північна Америка', 'Рудий', 'Помірний', 0, 0, 0, 'Антилопа', '-'),
(12, 'Ссавець', 170, 1, 1, 1, 1, 0, 1, 0, 30, 'Євразія, Америка', 'Коричневий', 'Помірний', 0, 0, 0, 'Олень', '-'),
(13, 'Ссавець', 170, 1, 1, 1, 1, 0, 1, 1, 40, 'Європа, Америка', 'Коричневий', 'Помірний', 0, 0, 0, 'Лось', '-'),
(14, 'Птахи', 45, 1, 0, 0, 0, 1, 1, 0, 0, 'Ліс', 'Сірий', 'Помірний Жаркий', 1, 1, 1, 'Сова', '-'),
(15, 'Ссавець', 60, 1, 0, 0, 1, 1, 0, 0, 0, 'Євразія, Америка', 'Коричневий Білий Чорний Сірий', 'Помірний', 0, 0, 0, 'Собака', '-'),
(16, 'Птахи', 45, 1, 0, 0, 0, 0, 1, 0, 0, 'Австралія', 'Білий', 'Жаркий', 1, 1, 0, 'Какаду', '-'),
(17, 'Ссавець', 30, 1, 0, 0, 1, 1, 0, 0, 0, '', 'Рудий Білий Чорний Сірий', 'Різний', 0, 0, 0, 'Кішка', '-'),
(18, 'Ссавець', 450, 1, 0, 0, 1, 0, 1, 0, 0, 'Африка', 'Плями', 'Жаркий', 0, 0, 0, 'Жирафа', '-'),
(19, 'Ссавець', 300, 1, 0, 0, 0, 0, 1, 0, 0, 'Африка', 'Сірий', 'Жаркий', 0, 0, 0, 'Слон', '-'),
(20, 'Ссавець', 130, 1, 0, 0, 1, 1, 1, 0, 0, 'Африка Азія', 'Плями', 'Жаркий', 0, 0, 0, 'Гепард', '-'),
(21, 'Птахи', 35, 1, 0, 0, 1, 1, 1, 0, 0, 'Прибережжя', 'Білий', 'Помірний', 1, 0, 0, 'Чайка', '-'),
(22, 'Птахи', 5, 1, 0, 0, 1, 0, 1, 0, 0, 'Америка Канада', 'Синій', 'Вологий холодний', 1, 0, 0, 'Колібрі', '-'),
(23, 'Птахи', 20, 1, 0, 0, 1, 0, 1, 0, 0, 'Європа', 'Сірий', 'Помірний', 1, 0, 0, 'Голуб', '-'),
(24, 'Птахи', 100, 1, 0, 0, 1, 0, 1, 0, 0, 'Індія', 'Синій Зелений', 'Тропічний', 0, 0, 0, 'Павлін', '-'),
(25, 'Птахи', 60, 1, 0, 0, 1, 1, 1, 0, 0, 'Євразія Північна Америка', 'Чорний', 'Помірний', 1, 0, 0, 'Ворона', '-'),
(26, 'Птахи', 30, 1, 0, 0, 1, 0, 0, 0, 0, 'Євразія', 'Рудий', 'Помірний', 0, 0, 0, 'Курка', '-'),
(27, 'Ссавець', 110, 1, 1, 0, 1, 0, 1, 0, 0, 'Саванна', 'Смуги', 'Жаркий', 0, 0, 0, 'Зебра', '-'),
(28, 'Земноводні', 0, 1, 0, 0, 1, 1, 1, 0, 0, '', 'Різний', 'Різний', 0, 0, 0, 'Змія', 'Луска'),
(29, 'Земноводні', 8, 0, 0, 0, 0, 0, 1, 0, 0, '', 'Різний', 'Різний', 0, 0, 0, 'Жаба', 'Бородавки'),
(30, 'Земноводні', 400, 1, 0, 0, 0, 1, 1, 0, 0, 'Австралія', 'Зелений', 'Тропічний', 0, 0, 0, 'Крокодил', 'Луска');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `table1`
--
ALTER TABLE `table1`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `table1`
--
ALTER TABLE `table1`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
